-------------------------------------
-- 物品附魔信息庫 Author: M
-------------------------------------
local MAJOR, MINOR = "LibItemEnchant.7000", 1
local lib = LibStub:NewLibrary(MAJOR, MINOR)

if not lib then
    return
end

-- Thanks to RRRRBUA(NGA)
local EnchantItemDB = {
    [15] = 2304,-- 轻型护甲片
    [16] = 2313,-- 中型护甲片
    [17] = 4265,-- 重型护甲片
    [18] = 8173,-- 厚重护甲片
    [28] = 61783,-- 瑟银带扣
    [30] = 4405,-- 粗制瞄准镜
    [32] = 4406,-- 普通瞄准镜
    [33] = 4407,-- 精确瞄准镜
    [34] = 6043,-- 铁质平衡锤
    [36] = 5421,-- 炽热魔符
    [37] = 6041,-- 钢质武器链
    [43] = 6042,-- 铁质盾刺
    [71] = 61779,-- 铜带扣
    [72] = 61780,-- 青铜带扣
    [73] = 41350,-- 原始石英
    [73] = 56000,-- 原始水晶石
    [90] = 41352,-- 尖锐黄水晶
    [90] = 56002,-- 尖锐黄水晶
    [94] = 56003,-- 闪亮水玉
    [96] = 56007,-- 辉煌蓝宝石
    [98] = 56005,-- 幻光宝玉
    [104] = 56017,-- 淬火艾泽拉斯钻石
    [107] = 56056,-- 燃星宝石
    [108] = 56015,-- 艾泽拉斯红玉
    [208] = 41351,-- 圆润翡翠
    [208] = 56001,-- 圆润翡翠
    [225] = 56018,-- 魔化翡翠
    [345] = 56076,-- 柔韧奥术石
    [371] = 55288,-- 强化体质符印
    [440] = 56010,-- 绚丽宝钻
    [463] = 7967,-- 秘银盾刺
    [464] = 7969,-- 秘银马刺
    [663] = 10546,-- 致命瞄准镜
    [664] = 10548,-- 狙击瞄准镜
    [763] = 61818,-- 华丽山地宝石
    [903] = 56013,-- 漆黑曜石
    [1250] = 56011,-- 不稳定的奥术宝石
    [1252] = 87,-- 魔化瑟银带扣
    [1267] = 92008,-- 奥术坚韧符印
    [1342] = 56012,-- 幽影墨玉
    [1344] = 82,-- 黑铁带扣
    [1388] = 56009,-- 优雅翡翠
    [1434] = 56075,-- 深沉白玉
    [1446] = 55287,-- 暗影抗性符印
    [1483] = 11622,-- 次级冥思秘药
    [1503] = 11642,-- 次级体质秘药
    [1504] = 11643,-- 次级坚韧秘药
    [1505] = 11644,-- 次级适应秘药
    [1506] = 11645,-- 次级贪婪秘药
    [1507] = 11646,-- 次级贪婪秘药
    [1508] = 11647,-- 次级贪婪秘药
    [1509] = 11648,-- 次级贪婪秘药
    [1510] = 11649,-- 次级贪婪秘药
    [1704] = 12645,-- 瑟银盾刺
    [1843] = 15564,-- 毛皮护甲片
    [1944] = 61784,-- 奥金带扣
    [2045] = 66,-- 金带扣
    [2082] = 56058,-- 无暇月亮石
    [2158] = 56004,-- 明亮灰烬石
    [2160] = 67,-- 龙鳞带扣
    [2236] = 56057,-- 辉光蓝宝石
    [2366] = 56077,-- 苏生黄玉
    [2483] = 18169,-- 火焰黎明衬肩
    [2484] = 18170,-- 冰霜黎明衬肩
    [2485] = 18171,-- 奥术黎明衬肩
    [2486] = 18172,-- 自然黎明衬肩
    [2487] = 18173,-- 暗影黎明衬肩
    [2488] = 18182,-- 多彩黎明衬肩
    [2503] = 18251,-- 熔火护甲片
    [2523] = 18283,-- 比兹尼克247x128精确瞄准镜
    [2543] = 18329,-- 急速秘药
    [2544] = 18330,-- 专注秘药
    [2545] = 18331,-- 防护秘药
    [2583] = 19782,-- 力量的证明
    [2584] = 19783,-- 调和的徽记
    [2585] = 19784,-- 死亡的拥抱
    [2586] = 19785,-- 猎鹰的召唤
    [2587] = 19786,-- 巫毒的警觉
    [2588] = 19787,-- 魔法的视域
    [2589] = 19788,-- 不祥的妖术
    [2590] = 19789,-- 预言的光环
    [2591] = 19790,-- 灵魂的安抚
    [2604] = 20078,-- 赞达拉宁静徽记
    [2605] = 20076,-- 赞达拉魔精徽记
    [2606] = 20077,-- 赞达拉力量徽记
    [2681] = 22635,-- 野性戒卫
    [2682] = 22636,-- 寒冰戒卫
    [2683] = 22638,-- 暗影戒卫
    [2715] = 23547,-- 天灾的活力
    [2716] = 23549,-- 天灾的坚韧
    [2717] = 23548,-- 天灾的威严
    [2721] = 23545,-- 天灾的力量
    [2722] = 131,-- 钢带扣
    [3005] = 65033,-- 赞达拉毅力印记
    [3008] = 56074,-- 璀璨玛瑙
    [3011] = 56006,-- 炽热红宝石
    [3012] = 61436,-- 吸血符印
    [3017] = 61437,-- 绚丽宝钻
    [3021] = 56112,-- 古代矮人宝石
    [3025] = 61183,-- 魔化护甲片
    [3026] = 61182,-- 瑟银马刺
    [3047] = 92007,-- 开阔思维符印
    [3049] = 92006,-- 保护符印
    [3051] = 61781,-- 铁带扣
    [3052] = 61785,-- 梦钢带扣
    [3054] = 61804,-- 坚韧印记
    [3057] = 151,-- 真银带扣
}
local EnchantItemDBEx = {
    [426] = {
        INVTYPE_FINGER = 56016, -- 奥术翡翠
        INVTYPE_NECK = 56016, -- 奥术翡翠
        INVTYPE_CHEST = 65, --龙喉护甲片
        INVTYPE_LEGS = 65, --龙喉护甲片
        INVTYPE_HAND = 65, --龙喉护甲片
        INVTYPE_FEET = 65, --龙喉护甲片
    },
    [92] = {
    INVTYPE_WAIST = 61782,-- 秘银带扣
    INVTYPE_FINGER = 56008,-- 闪耀白玉
    INVTYPE_NECK = 56008,-- 闪耀白玉
    },
    [362] = {
     INVTYPE_HEAD= 55289,-- 贪婪之欲符印
     INVTYPE_LEGS= 55289,-- 贪婪之欲符印
     INVTYPE_WAIST = 103,-- 黑曜石带扣
    },
    [3038] = {
     INVTYPE_HEAD= 92005,-- 碎裂符印
     INVTYPE_LEGS= 92005,-- 碎裂欲符印
     INVTYPE_SHOULDER = 61438,-- 穿透符印
    }
}


-- Data from: M, RRRRBUA(NGA), KibsItemLevel
local EnchantSpellDB = {

    [24] = 7443, -- 卷轴：附魔胸甲 - 初级法力
    [44] = 7426, -- 卷轴：附魔胸甲 - 初级吸收
    [63] = 13538, -- 卷轴：附魔胸甲 - 次级吸收
    [65] = 7454, -- 卷轴：附魔披风 - 初级抗性
    [68] = 7783, -- 卷轴：附魔护腕 - 初级力量
    [80] = 45071, -- 附魔双手武器 - 初级智力
    [242] = 7748, -- 卷轴：附魔胸甲 - 次级生命
    [243] = 7766, -- 卷轴：附魔护腕 - 初级精神
    [246] = 7776, -- 卷轴：附魔胸甲 - 次级法力
    [248] = 7782, -- 卷轴：附魔护腕 - 初级力量
    [249] = 7786, -- 卷轴：附魔武器 - 初级屠兽
    [250] = 7788, -- 卷轴：附魔武器 - 初级攻击
    [254] = 7857, -- 卷轴：附魔胸甲 - 生命
    [256] = 7861, -- 卷轴：附魔披风 - 次级火焰抗性
    [354] = 56543, -- 附魔靴子 - 特效智力
    [357] = 46086, -- 附魔手套 - 特效力量
    [370] = 57142, -- 附魔靴子 - 强效精神
    [432] = 57028, -- 附魔护腕 - 法术强度
    [744] = 13421, -- 卷轴：附魔披风 - 次级防护
    [783] = 7771, -- 卷轴：附魔披风 - 初级防护
    [803] = 13898, -- 卷轴：附魔武器 - 烈焰
    [804] = 13522, -- 卷轴：附魔披风 - 次级暗影抵抗
    [805] = 13943, -- 卷轴：附魔武器 - 强效攻击
    [823] = 13536, -- 卷轴：附魔护腕 - 次级力量
    [843] = 13607, -- 卷轴：附魔胸甲 - 法力
    [844] = 13612, -- 卷轴：附魔手套 - 采矿
    [845] = 13617, -- 卷轴：附魔手套 - 草药学
    [847] = 13626, -- 卷轴：附魔胸甲 - 初级属性
    [850] = 13640, -- 卷轴：附魔胸甲 - 强效生命
    [853] = 13653, -- 卷轴：附魔武器 - 次级屠兽
    [854] = 13655, -- 卷轴：附魔武器 - 次级元素杀手
    [857] = 13663, -- 卷轴：附魔胸甲 - 强效法力
    [863] = 13689, -- 卷轴：附魔盾牌 - 次级格挡
    [865] = 13698, -- 卷轴：附魔手套 - 剥皮
    [866] = 13700, -- 卷轴：附魔胸甲 - 次级状态
    [884] = 13746, -- 卷轴：附魔披风 - 强效防御
    [903] = 13794, -- 卷轴：附魔披风 - 抗性
    [905] = 13822, -- 卷轴：附魔护腕 - 智力
    [906] = 13841, -- 卷轴：附魔手套 - 高级采矿
    [908] = 13858, -- 卷轴：附魔胸甲 - 超强生命
    [909] = 13868, -- 卷轴：附魔手套 - 高级草药学
    [910] = 25083, -- 卷轴：附魔披风 - 潜行
    [911] = 13890, -- 卷轴：附魔靴子 - 初级速度
    [912] = 13915, -- 卷轴：附魔武器 - 屠魔
    [913] = 13917, -- 卷轴：附魔胸甲 - 超强法力
    [923] = 13931, -- 卷轴：附魔护腕 - 偏斜
    [924] = 7428, -- 卷轴：附魔护腕 - 初级偏斜
    [925] = 13646, -- 卷轴：附魔护腕 - 次级偏斜
    [926] = 13933, -- 卷轴：附魔盾牌 - 冰霜抗性
    [928] = 13941, -- 卷轴：附魔胸甲 - 状态
    [930] = 13947, -- 卷轴：附魔手套 - 骑乘
    [931] = 13948, -- 卷轴：附魔手套 - 初级加速
    [963] = 13937, -- 卷轴：附魔双手武器 - 强效冲击
    [1068] = 57127, -- 附魔靴子 - 超强耐力
    [1257] = 57117, -- 附魔披风 - 强效奥术抗性
    [1883] = 20008, -- 卷轴：附魔护腕 - 强效智力
    [1884] = 20009, -- 卷轴：附魔护腕 - 超强精神
    [1885] = 20010, -- 卷轴：附魔护腕 - 超强力量
    [1886] = 20011, -- 卷轴：附魔护腕 - 超强耐力
    [1888] = 20014, -- 卷轴：附魔披风 - 强效抗性
    [1889] = 20015, -- 卷轴：附魔披风 - 超强防御
    [1890] = 20016, -- 卷轴：附魔盾牌 - 活力
    [1891] = 20025, -- 卷轴：附魔胸甲 - 强效属性
    [1892] = 20026, -- 卷轴：附魔胸甲 - 特效生命
    [1893] = 20028, -- 卷轴：附魔胸甲 - 特效法力
    [1894] = 20029, -- 卷轴：附魔武器 - 冰寒
    [1896] = 20030, -- 卷轴：附魔双手武器 - 超强冲击
    [1898] = 20032, -- 卷轴：附魔武器 - 生命偷取
    [1899] = 20033, -- 卷轴：附魔武器 - 邪恶武器
    [1900] = 20034, -- 卷轴：附魔武器 - 十字军
    [1903] = 20035, -- 卷轴：附魔双手武器 - 特效精神
    [1904] = 20036, -- 卷轴：附魔双手武器 - 特效智力
    [2443] = 21931, -- 卷轴：附魔武器 - 寒冬之力
    [2463] = 13657, -- 卷轴：附魔披风 - 火焰抗性
    [2504] = 22749, -- 卷轴：附魔武器 - 法术能量
    [2505] = 22750, -- 卷轴：附魔武器 - 治疗能量
    [2563] = 23799, -- 卷轴：附魔武器 - 力量
    [2565] = 23801, -- 卷轴：附魔护腕 - 法力回复
    [2566] = 23802, -- 卷轴：附魔护腕 - 治疗能量
    [2567] = 23803, -- 卷轴：附魔武器 - 强效精神
    [2568] = 23804, -- 卷轴：附魔武器 - 强效智力
    [2603] = 13620, -- 卷轴：附魔手套 - 钓鱼
    [2613] = 25072, -- 卷轴：附魔手套 - 威胁
    [2614] = 25073, -- 卷轴：附魔手套 - 暗影能量
    [2615] = 25074, -- 卷轴：附魔手套 - 冰霜能量
    [2616] = 25078, -- 卷轴：附魔手套 - 火焰能量
    [2617] = 25079, -- 卷轴：附魔手套 - 治疗能量
    [2619] = 25081, -- 卷轴：附魔披风 - 强效火焰抗性
    [2620] = 25082, -- 卷轴：附魔披风 - 强效自然抗性
    [2621] = 25084, -- 卷轴：附魔披风 - 狡诈
    [2622] = 25086, -- 卷轴：附魔披风 - 躲闪
    [2646] = 27837, -- 卷轴：附魔双手武器 - 敏捷
    [3001] = 46601, -- 卷轴：附魔手套 - 奥术能量
    [3002] = 46602, -- 卷轴：附魔手套 - 自然之力
    [3003] = 46603, -- 卷轴：附魔手套 - 神圣之力
    [3024] = 57144, -- 卷轴：附魔护腕 - 强效偏斜
    --[[以下未找到附魔ID
    57032		附魔护腕 - 法术穿透		永久性地为一副护腕附魔，使其获得法术穿透+6的效果。
    57034		附魔护腕 - 强效法术穿透		永久性地为一副护腕附魔，使其获得法术穿透+10的效果。
    57036		附魔护腕 - 超强法术穿透		永久性地为一副护腕附魔，使其获得法术穿透+15的效果。
    ]]
}
--[[

"INVTYPE_AMMO"	Ammo	0 弹药
"INVTYPE_HEAD"	Head	1 头部
"INVTYPE_NECK"	Neck	2 颈部
"INVTYPE_SHOULDER"	Shoulder	3 肩部
"INVTYPE_BODY"	Shirt	4
"INVTYPE_CHEST"	Chest	5 胸部
"INVTYPE_ROBE"	Chest	5
"INVTYPE_WAIST"	Waist	6 腰部
"INVTYPE_LEGS"	Legs	7 腿部
"INVTYPE_FEET"	Feet	8 脚部
"INVTYPE_WRIST"	Wrist	9 手腕
"INVTYPE_HAND"	Hands	10 手部
"INVTYPE_FINGER"	Fingers	11,12 手指
"INVTYPE_TRINKET"	Trinkets	13,14 饰品
"INVTYPE_CLOAK"	Cloaks	15 背部
"INVTYPE_WEAPON"	One-Hand	16,17 单手武器
"INVTYPE_SHIELD"	Shield	17 盾牌
"INVTYPE_2HWEAPON"	Two-Handed	16 双手武器
]]

local EnchantSpellDBEx = {
    [41] = {
        INVTYPE_WRIST = 7418, --	卷轴：附魔护腕 - 初级生命
        INVTYPE_CHEST = 7420 --	卷轴：附魔胸甲 - 初级生命
    },
    [66] = {
        INVTYPE_WRIST = 7457, --	卷轴：附魔护腕 - 初级耐力
        INVTYPE_FEET = 7863, --	卷轴：附魔靴子 - 初级耐力
        INVTYPE_SHIELD = 13378 --	卷轴：附魔盾牌 - 初级耐力
    },
    [241] = {
        INVTYPE_2HWEAPON = 7745, --	卷轴：附魔双手武器 - 初级冲击
        INVTYPE_WEAPON = 13503 --	卷轴：附魔武器 - 次级攻击
    },
    [247] = {
        INVTYPE_WRIST = 7779, --	卷轴：附魔护腕 - 初级敏捷
        INVTYPE_FEET = 7867, --	卷轴：附魔靴子 - 初级敏捷
        INVTYPE_CLOAK = 13419 --	卷轴：附魔披风 - 初级敏捷
    },
    [255] = {
        INVTYPE_WRIST = 7859, --	卷轴：附魔护腕 - 次级精神
        INVTYPE_2HWEAPON = 13380, --	卷轴：附魔双手武器 - 次级精神
        INVTYPE_SHIELD = 13485, --	卷轴：附魔盾牌 - 次级精神
        INVTYPE_FEET = 13687 --	卷轴：附魔靴子 - 次级精神
    },
    [723] = {
        INVTYPE_2HWEAPON = 7793, --	卷轴：附魔双手武器 - 次级智力
        INVTYPE_WRIST = 13622 --	卷轴：附魔护腕 - 次级智力
    },
    [724] = {
        INVTYPE_WRIST = 13501, --	卷轴：附魔护腕 - 次级耐力
        INVTYPE_SHIELD = 13631, --	卷轴：附魔盾牌 - 次级耐力
        INVTYPE_FEET = 13644 --	卷轴：附魔靴子 - 次级耐力
    },
    [848] = {
        INVTYPE_SHIELD = 13464, --	卷轴：附魔盾牌 - 次级防护
        INVTYPE_CLOAK = 13635 --	卷轴：附魔披风 - 防御
    },
    [849] = {
        INVTYPE_FEET = 13637, --	卷轴：附魔靴子 - 次级敏捷
        INVTYPE_CLOAK = 13882 --	卷轴：附魔披风 - 次级敏捷
    },
    [851] = {
        INVTYPE_WRIST = 13642, --	卷轴：附魔护腕 - 精神
        INVTYPE_SHIELD = 13659, --	卷轴：附魔盾牌 - 精神
        INVTYPE_FEET = 20024 --	卷轴：附魔靴子 - 精神
    },
    [852] = {
        INVTYPE_WRIST = 13648, --	卷轴：附魔护腕 - 耐力
        INVTYPE_SHIELD = 13817, --	卷轴：附魔盾牌 - 耐力
        INVTYPE_FEET = 13836 --	卷轴：附魔靴子 - 耐力
    },
    [856] = {
        INVTYPE_WRIST = 13661, --	卷轴：附魔护腕 - 力量
        INVTYPE_HAND = 13887 --	卷轴：附魔手套 - 力量
    },
    [904] = {
        INVTYPE_HAND = 13815, --	卷轴：附魔手套 - 敏捷
        INVTYPE_FEET = 13935 --	卷轴：附魔靴子 - 敏捷
    },
    [907] = {
        INVTYPE_WRIST = 13846, --	卷轴：附魔护腕 - 强效精神
        INVTYPE_SHIELD = 13905 --	卷轴：附魔盾牌 - 强效精神
    },
    [927] = {
        INVTYPE_WRIST = 13939, --	卷轴：附魔护腕 - 强效力量
        INVTYPE_HAND = 20013 --	卷轴：附魔手套 - 强效力量
    },
    [929] = {
        INVTYPE_WRIST = 13945, --	卷轴：附魔护腕 - 强效耐力
        INVTYPE_SHIELD = 20017, --	卷轴：附魔盾牌 - 强效耐力
        INVTYPE_FEET = 20020 --	卷轴：附魔靴子 - 强效耐力
    },
    [943] = {
        INVTYPE_2HWEAPON = 13529, --	卷轴：附魔双手武器 - 次级冲击
        INVTYPE_WEAPON = 13693 --	卷轴：附魔武器 - 攻击
    },
    [1483] = {
        INVTYPE_CHEST = 57119, --	卷轴：附魔胸甲 - 优异法力
    },
    [1887] = {
        INVTYPE_HAND = 20012, --	卷轴：附魔手套 - 强效敏捷
        INVTYPE_FEET = 20023, --	卷轴：附魔靴子 - 强效敏捷
        INVTYPE_WRIST = 57030 --	卷轴：附魔护腕 - 强效敏捷
    },
    [1897] = {
        INVTYPE_2HWEAPON = 13695, --	卷轴：附魔双手武器 - 冲击
        INVTYPE_WEAPON = 20031 --	卷轴：附魔武器 - 超强打击
    },
    [2564] = {
        INVTYPE_WEAPON = 23800, -- 附魔武器 - 敏捷
        INVTYPE_HAND = 25080 --	附魔手套 - 超强敏捷
    },
    [3011] = {
        INVTYPE_WRIST = 57146, -- 附魔护腕 - 吸血鬼
        INVTYPE_FEET = 57148 -- 附魔靴子 - 吸血鬼
    },
}
function lib:GetEnchantSpellID(ItemLink)
    local enchant = tonumber(string.match(ItemLink, "item:%d+:(%d+):"))

    local _, _, vItemCode = strfind(ItemLink, "item:(%d+):(%d+):(%d+):"); 
    local _, _, _, _, _, _, _, itemEquip = GetItemInfo(vItemCode) -- 获取 装备类型
    if (enchant and EnchantSpellDBEx[enchant]) then -- 有附魔 并且主目录不存在
        local enchantItemID = EnchantSpellDBEx[enchant] -- 副目录校验
        if (enchantItemID ~= nil) then
            return EnchantSpellDBEx[enchant][itemEquip], enchant
        end
    end
    if (enchant and EnchantSpellDB[enchant]) then
        return EnchantSpellDB[enchant], enchant
    end
    return nil,nil, enchant
end

function lib:GetEnchantItemID(ItemLink)
    local enchant = tonumber(string.match(ItemLink, "item:%d+:(%d+):"))

    local _, _, vItemCode = strfind(ItemLink, "item:(%d+):(%d+):(%d+):"); 
    local _, _, _, _, _, _, _, itemEquip = GetItemInfo(vItemCode) -- 获取 装备类型
    if enchant == 1483 and itemEquip == "INVTYPE_CHEST" then return end --1483有三个部位，头部和腿部为次级冥想秘药，胸为附魔胸甲 - 优异法力
    if enchant == 3011 and (itemEquip == "INVTYPE_WRIST" or itemEquip == "INVTYPE_FEET") then return end --3011有四个部位，项链和戒指为炽热红宝石，护腕和脚部为附魔 - 吸血鬼
    if enchant == 928 and itemEquip == "INVTYPE_CHEST" then return end --928有三个部位，项链和戒指为惊艳帝王石，胸部为附魔 - 状态

    if (enchant and EnchantItemDBEx[enchant]) then -- 有附魔 并且主目录不存在
        local enchantItemID = EnchantItemDBEx[enchant] -- 副目录校验
        if (enchantItemID ~= nil) then
            return EnchantItemDBEx[enchant][itemEquip], enchant
        end
    end
    if (enchant and EnchantItemDB[enchant]) then
        return EnchantItemDB[enchant], enchant
    end
    return nil, enchant
end
